Ran Plan for dir: `live/newsletter-server` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "terragrunt plan -input=false $(printf '%s' $COMMENT_ARGS | sed 's/,/ /g' | tr -d '\\\\') -no-color -out $PLANFILE" in "/atlantis-data/repos/meysam81/infra/41/default/live/newsletter-server": exit status 1: running "terragrunt plan -input=false $(printf '%s' $COMMENT_ARGS | sed 's/,/ /g' | tr -d '\\\\') -no-color -out $PLANFILE" in "/atlantis-data/repos/meysam81/infra/41/default/live/newsletter-server": 
14:27:01.085 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: Initializing the backend...
14:27:01.088 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: Initializing the backend...
14:27:02.277 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: 
14:27:02.277 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: Successfully configured the backend "remote"! OpenTofu will automatically
14:27:02.277 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: use this backend unless the backend configuration changes.
14:27:02.292 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: 
14:27:02.292 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: Successfully configured the backend "remote"! OpenTofu will automatically
14:27:02.292 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: use this backend unless the backend configuration changes.
14:27:03.338 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: Initializing provider plugins...
14:27:03.338 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: - Reusing previous version of olivr/gpg from the dependency lock file
14:27:03.344 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: Initializing provider plugins...
14:27:03.344 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: - Reusing previous version of hashicorp/tls from the dependency lock file
14:27:03.460 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: - Reusing previous version of integrations/github from the dependency lock file
14:27:03.536 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: - Reusing previous version of integrations/github from the dependency lock file
14:27:03.572 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: - Reusing previous version of hashicorp/random from the dependency lock file
14:27:04.811 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: - Installing olivr/gpg v0.2.1...
14:27:04.839 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: - Installing hashicorp/tls v4.0.6...
14:27:05.695 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: - Installed olivr/gpg v0.2.1. Signature validation was skipped due to the registry not containing GPG keys for this provider
14:27:05.704 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: - Installed hashicorp/tls v4.0.6 (signed, key ID 0C0AF313E5FD9F80)
14:27:06.874 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: - Installing integrations/github v6.3.0...
14:27:06.884 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: - Installing integrations/github v6.3.0...
14:27:07.791 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: - Installed integrations/github v6.3.0 (signed, key ID 38027F80D7FD5FB2)
14:27:07.791 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: Providers are signed by their developers.
14:27:07.791 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: If you'd like to know more about provider signing, you can read about it here:
14:27:07.791 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: https://opentofu.org/docs/cli/plugins/signing/
14:27:07.792 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: OpenTofu has made some changes to the provider dependency selections recorded
14:27:07.792 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: in the .terraform.lock.hcl file. Review those changes and commit them to your
14:27:07.792 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: version control system if they represent changes you intended to make.
14:27:07.792 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: OpenTofu has been successfully initialized!
14:27:07.838 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: - Installed integrations/github v6.3.0 (signed, key ID 38027F80D7FD5FB2)
14:27:09.028 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: - Installing hashicorp/random v3.6.3...
14:27:09.920 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: - Installed hashicorp/random v3.6.3 (signed, key ID 0C0AF313E5FD9F80)
14:27:09.920 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: Providers are signed by their developers.
14:27:09.920 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: If you'd like to know more about provider signing, you can read about it here:
14:27:09.920 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: https://opentofu.org/docs/cli/plugins/signing/
14:27:09.921 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: OpenTofu has made some changes to the provider dependency selections recorded
14:27:09.921 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: in the .terraform.lock.hcl file. Review those changes and commit them to your
14:27:09.921 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: version control system if they represent changes you intended to make.
14:27:09.921 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: OpenTofu has been successfully initialized!
14:27:12.143 STDOUT tofu1.8.3: Initializing the backend...
14:27:13.266 STDOUT tofu1.8.3: Successfully configured the backend "remote"! OpenTofu will automatically
14:27:13.266 STDOUT tofu1.8.3: use this backend unless the backend configuration changes.
14:27:14.225 STDOUT tofu1.8.3: Initializing provider plugins...
14:27:14.225 STDOUT tofu1.8.3: - Reusing previous version of hashicorp/aws from the dependency lock file
14:27:14.384 STDOUT tofu1.8.3: - Finding latest version of hashicorp/null...
14:27:14.469 STDOUT tofu1.8.3: - Reusing previous version of hetznercloud/hcloud from the dependency lock file
14:27:14.597 STDOUT tofu1.8.3: - Reusing previous version of hashicorp/tls from the dependency lock file
14:27:14.704 STDOUT tofu1.8.3: - Reusing previous version of hashicorp/random from the dependency lock file
14:27:14.749 STDOUT tofu1.8.3: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
14:27:16.243 STDOUT tofu1.8.3: - Installing hashicorp/aws v5.68.0...
14:27:22.999 STDOUT tofu1.8.3: - Installed hashicorp/aws v5.68.0 (signed, key ID 0C0AF313E5FD9F80)
14:27:24.123 STDOUT tofu1.8.3: - Installing hashicorp/null v3.2.3...
14:27:24.826 STDOUT tofu1.8.3: - Installed hashicorp/null v3.2.3 (signed, key ID 0C0AF313E5FD9F80)
14:27:26.060 STDOUT tofu1.8.3: - Installing hetznercloud/hcloud v1.48.1...
14:27:26.988 STDOUT tofu1.8.3: - Installed hetznercloud/hcloud v1.48.1 (signed, key ID 5219EACB3A77198B)
14:27:27.807 STDOUT tofu1.8.3: - Installing hashicorp/tls v4.0.6...
14:27:28.479 STDOUT tofu1.8.3: - Installed hashicorp/tls v4.0.6 (signed, key ID 0C0AF313E5FD9F80)
14:27:29.348 STDOUT tofu1.8.3: - Installing hashicorp/random v3.6.3...
14:27:30.020 STDOUT tofu1.8.3: - Installed hashicorp/random v3.6.3 (signed, key ID 0C0AF313E5FD9F80)
14:27:31.238 STDOUT tofu1.8.3: - Installing cloudflare/cloudflare v4.42.0...
14:27:32.563 STDOUT tofu1.8.3: - Installed cloudflare/cloudflare v4.42.0 (signed, key ID C76001609EE3B136)
14:27:32.563 STDOUT tofu1.8.3: Providers are signed by their developers.
14:27:32.563 STDOUT tofu1.8.3: If you'd like to know more about provider signing, you can read about it here:
14:27:32.563 STDOUT tofu1.8.3: https://opentofu.org/docs/cli/plugins/signing/
14:27:32.563 STDOUT tofu1.8.3: OpenTofu has made some changes to the provider dependency selections recorded
14:27:32.563 STDOUT tofu1.8.3: in the .terraform.lock.hcl file. Review those changes and commit them to your
14:27:32.564 STDOUT tofu1.8.3: version control system if they represent changes you intended to make.
14:27:32.564 STDOUT tofu1.8.3: OpenTofu has been successfully initialized!
14:27:38.918 STDOUT tofu1.8.3: hcloud_network.this: Refreshing state... [id=10090102]
14:27:38.918 STDOUT tofu1.8.3: hcloud_volume.varlib: Refreshing state... [id=101246358]
14:27:38.918 STDOUT tofu1.8.3: random_password.k3s_token: Refreshing state... [id=none]
14:27:38.918 STDOUT tofu1.8.3: hcloud_primary_ip.this["ipv6"]: Refreshing state... [id=68641522]
14:27:38.918 STDOUT tofu1.8.3: tls_private_key.this: Refreshing state... [id=66dfe3eccaa9b069015a22812e79e4c13ae8033a]
14:27:38.918 STDOUT tofu1.8.3: hcloud_primary_ip.this["ipv4"]: Refreshing state... [id=68641521]
14:27:38.924 STDOUT tofu1.8.3: data.cloudflare_zone.this: Reading...
14:27:38.942 STDOUT tofu1.8.3: hcloud_firewall.this: Refreshing state... [id=1587707]
14:27:38.953 STDOUT tofu1.8.3: hcloud_ssh_key.this: Refreshing state... [id=22765653]
14:27:39.117 STDOUT tofu1.8.3: hcloud_network_subnet.this: Refreshing state... [id=10090102-172.16.16.0/20]
14:27:39.297 STDOUT tofu1.8.3: hcloud_server.this: Refreshing state... [id=52684920]
14:27:39.543 STDOUT tofu1.8.3: hcloud_volume_attachment.varlib: Refreshing state... [id=101246358]
14:27:39.543 STDOUT tofu1.8.3: hcloud_server_network.this: Refreshing state... [id=52684920-10090102]
14:27:39.543 STDOUT tofu1.8.3: hcloud_firewall_attachment.this: Refreshing state... [id=1587707]
14:27:39.816 STDOUT tofu1.8.3: data.cloudflare_zone.this: Read complete after 1s [id=e0cc9a85b6f39e176952e80f9b744248]
14:27:39.822 STDOUT tofu1.8.3: cloudflare_record.atlantis["AAAA"]: Refreshing state... [id=19a129e63172a0e0bcda002360d67f15]
14:27:39.825 STDOUT tofu1.8.3: cloudflare_record.vmsingle["AAAA"]: Refreshing state... [id=e550a66b7b467537ab35e4aa8bfc45fa]
14:27:39.825 STDOUT tofu1.8.3: cloudflare_record.auth_server["AAAA"]: Refreshing state... [id=fb1167036309a495d9ae9e5b11a61c33]
14:27:39.826 STDOUT tofu1.8.3: cloudflare_record.vmsingle["A"]: Refreshing state... [id=d1a7ec5d2b154f3e0c54b031dd2dc683]
14:27:39.826 STDOUT tofu1.8.3: cloudflare_record.auth_server["A"]: Refreshing state... [id=b18e490903f09fef85d3f8a201135cfd]
14:27:39.826 STDOUT tofu1.8.3: cloudflare_record.atlantis["A"]: Refreshing state... [id=af003e07497ecfb0be30129aa18ccdee]
14:27:39.827 STDOUT tofu1.8.3: cloudflare_record.newsletter["A"]: Refreshing state... [id=d95b423dfa835ab2119e2632418b3042]
14:27:39.827 STDOUT tofu1.8.3: cloudflare_record.vmagent["A"]: Refreshing state... [id=0352915c8f7b31f76a83bdeaab37356e]
14:27:39.828 STDOUT tofu1.8.3: cloudflare_record.vmagent["AAAA"]: Refreshing state... [id=68f9441c3cec3f737ef002bde5ffca29]
14:27:40.536 STDOUT tofu1.8.3: cloudflare_record.alertmanager["A"]: Refreshing state... [id=02c0c652542029a4374b2512407d10cf]
14:27:40.707 STDOUT tofu1.8.3: cloudflare_record.alertmanager["AAAA"]: Refreshing state... [id=70ea2da720f31529b05ed98ffb835db8]
14:27:40.970 STDOUT tofu1.8.3: cloudflare_record.newsletter["AAAA"]: Refreshing state... [id=faa03b14676e9bed2bca92864c4ec66b]
14:27:41.285 STDOUT tofu1.8.3: cloudflare_record.auth["A"]: Refreshing state... [id=eeb2a3fd0f6b0e42abc21a1c3785fb21]
14:27:41.409 STDOUT tofu1.8.3: cloudflare_record.auth["AAAA"]: Refreshing state... [id=709856879eca01fc17ca016cacd1389b]
14:27:47.170 STDOUT tofu1.8.3: OpenTofu used the selected providers to generate the following execution
14:27:47.171 STDOUT tofu1.8.3: plan. Resource actions are indicated with the following symbols:
14:27:47.171 STDOUT tofu1.8.3:   + create
14:27:47.171 STDOUT tofu1.8.3:   ~ update in-place
14:27:47.171 STDOUT tofu1.8.3: -/+ destroy and then create replacement
14:27:47.171 STDOUT tofu1.8.3: OpenTofu planned the following actions, but then encountered a problem:
14:27:47.171 STDOUT tofu1.8.3:   # hcloud_firewall_attachment.this will be updated in-place
14:27:47.171 STDOUT tofu1.8.3:   ~ resource "hcloud_firewall_attachment" "this" {
14:27:47.171 STDOUT tofu1.8.3:         id              = "1587707"
14:27:47.171 STDOUT tofu1.8.3:       ~ server_ids      = [
14:27:47.171 STDOUT tofu1.8.3:           - 52684920,
14:27:47.171 STDOUT tofu1.8.3:         ] -> (known after apply)
14:27:47.171 STDOUT tofu1.8.3:         # (2 unchanged attributes hidden)
14:27:47.171 STDOUT tofu1.8.3:     }
14:27:47.171 STDOUT tofu1.8.3:   # hcloud_server.this must be replaced
14:27:47.171 STDOUT tofu1.8.3: -/+ resource "hcloud_server" "this" {
14:27:47.171 STDOUT tofu1.8.3:       + backup_window              = (known after apply)
14:27:47.171 STDOUT tofu1.8.3:       ~ datacenter                 = "nbg1-dc3" -> (known after apply)
14:27:47.172 STDOUT tofu1.8.3:       ~ firewall_ids               = [
14:27:47.172 STDOUT tofu1.8.3:           - 1587707,
14:27:47.172 STDOUT tofu1.8.3:         ] -> (known after apply)
14:27:47.172 STDOUT tofu1.8.3:       ~ id                         = "52684920" -> (known after apply)
14:27:47.172 STDOUT tofu1.8.3:       ~ ipv4_address               = "128.140.71.149" -> (known after apply)
14:27:47.172 STDOUT tofu1.8.3:       ~ ipv6_address               = "2a01:4f8:1c1b:68c6::1" -> (known after apply)
14:27:47.172 STDOUT tofu1.8.3:       ~ ipv6_network               = "2a01:4f8:1c1b:68c6::/64" -> (known after apply)
14:27:47.172 STDOUT tofu1.8.3:       - labels                     = {} -> null
14:27:47.172 STDOUT tofu1.8.3:         name                       = "personal"
14:27:47.172 STDOUT tofu1.8.3:       - placement_group_id         = 0 -> null
14:27:47.172 STDOUT tofu1.8.3:       ~ primary_disk_size          = 40 -> (known after apply)
14:27:47.172 STDOUT tofu1.8.3:       ~ status                     = "running" -> (known after apply)
14:27:47.173 STDOUT tofu1.8.3:       ~ user_data                  = (sensitive value) # forces replacement
14:27:47.173 STDOUT tofu1.8.3:         # (10 unchanged attributes hidden)
14:27:47.173 STDOUT tofu1.8.3:         # (1 unchanged block hidden)
14:27:47.173 STDOUT tofu1.8.3:     }
14:27:47.173 STDOUT tofu1.8.3:   # hcloud_server_network.this must be replaced
14:27:47.173 STDOUT tofu1.8.3: -/+ resource "hcloud_server_network" "this" {
14:27:47.173 STDOUT tofu1.8.3:       - alias_ips   = [] -> null
14:27:47.173 STDOUT tofu1.8.3:       ~ id          = "52684920-10090102" -> (known after apply)
14:27:47.173 STDOUT tofu1.8.3:       ~ ip          = "172.16.16.1" -> (known after apply)
14:27:47.173 STDOUT tofu1.8.3:       ~ mac_address = "86:00:00:fa:b1:cf" -> (known after apply)
14:27:47.173 STDOUT tofu1.8.3:       ~ server_id   = 52684920 # forces replacement -> (known after apply) # forces replacement
14:27:47.173 STDOUT tofu1.8.3:         # (1 unchanged attribute hidden)
14:27:47.174 STDOUT tofu1.8.3:     }
14:27:47.174 STDOUT tofu1.8.3:   # hcloud_volume_attachment.varlib must be replaced
14:27:47.174 STDOUT tofu1.8.3: -/+ resource "hcloud_volume_attachment" "varlib" {
14:27:47.174 STDOUT tofu1.8.3:       ~ id        = "101246358" -> (known after apply)
14:27:47.174 STDOUT tofu1.8.3:       ~ server_id = 52684920 # forces replacement -> (known after apply) # forces replacement
14:27:47.174 STDOUT tofu1.8.3:         # (2 unchanged attributes hidden)
14:27:47.174 STDOUT tofu1.8.3:     }
14:27:47.174 STDOUT tofu1.8.3:   # null_resource.example will be created
14:27:47.174 STDOUT tofu1.8.3:   + resource "null_resource" "example" {
14:27:47.174 STDOUT tofu1.8.3:       + id = (known after apply)
14:27:47.174 STDOUT tofu1.8.3:     }
14:27:47.174 STDOUT tofu1.8.3: Plan: 4 to add, 1 to change, 3 to destroy.
14:27:47.174 STDOUT tofu1.8.3: Changes to Outputs:
14:27:47.174 STDOUT tofu1.8.3:   ~ cloudinit_config = (sensitive value)
14:27:47.174 STDERR tofu1.8.3: Error: Invalid provider configuration
14:27:47.174 STDERR tofu1.8.3: Provider "registry.opentofu.org/hashicorp/aws" requires explicit
14:27:47.175 STDERR tofu1.8.3: configuration. Add a provider block to the root module and configure the
14:27:47.175 STDERR tofu1.8.3: provider's required arguments as described in the provider documentation.
14:27:47.175 STDERR tofu1.8.3: Error: No valid credential sources found
14:27:47.175 STDERR tofu1.8.3:   with provider["registry.opentofu.org/hashicorp/aws"],
14:27:47.175 STDERR tofu1.8.3:   on provider["registry.opentofu.org/hashicorp/aws"] with no configuration line 1:
14:27:47.175 STDERR tofu1.8.3:   (source code not available)
14:27:47.175 STDERR tofu1.8.3: Please see https://registry.terraform.io/providers/hashicorp/aws
14:27:47.175 STDERR tofu1.8.3: for more information about providing credentials.
14:27:47.175 STDERR tofu1.8.3: Error: failed to refresh cached credentials, failed to retrieve credentials,
14:27:47.175 STDERR tofu1.8.3: operation error STS: AssumeRoleWithWebIdentity, exceeded maximum number of
14:27:47.175 STDERR tofu1.8.3: attempts, 3, https response error StatusCode: 400, RequestID:
14:27:47.176 STDERR tofu1.8.3: 73945df7-10b4-4198-9278-48f5112e8d8c, InvalidIdentityToken: Token audience
14:27:47.176 STDERR tofu1.8.3: contains more than one audience while authorized party is not present
14:27:47.419 ERROR  tofu invocation failed in .
14:27:47.419 ERROR  error occurred:

* Failed to execute "tofu1.8.3 plan -input=false -no-color -out ./default.tfplan" in .
  
  Error: Invalid provider configuration
  
  Provider "registry.opentofu.org/hashicorp/aws" requires explicit
  configuration. Add a provider block to the root module and configure the
  provider's required arguments as described in the provider documentation.
  
  
  Error: No valid credential sources found
  
    with provider["registry.opentofu.org/hashicorp/aws"],
    on provider["registry.opentofu.org/hashicorp/aws"] with no configuration line 1:
    (source code not available)
  
  Please see https://registry.terraform.io/providers/hashicorp/aws
  for more information about providing credentials.
  
  Error: failed to refresh cached credentials, failed to retrieve credentials,
  operation error STS: AssumeRoleWithWebIdentity, exceeded maximum number of
  attempts, 3, https response error StatusCode: 400, RequestID:
  73945df7-10b4-4198-9278-48f5112e8d8c, InvalidIdentityToken: Token audience
  contains more than one audience while authorized party is not present
  
  
  exit status 1

14:27:47.429 ERROR  Suggested fixes: 
Missing AWS credentials. Provide credentials to proceed.


```
</details>